ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/AUDIO_Standalone/Src/main.c
//{{{
static uint8_t* deviceDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  *length = sizeof(kDeviceDescriptor);
  return (uint8_t*)kDeviceDescriptor;
  }
//}}}
//{{{
static uint8_t* langIDStrDescriptor(USBD_SpeedTypeDef speed, uint16_t* length) {
  *length = sizeof(kLangIdDescriptor);
  return (uint8_t*)kLangIdDescriptor;
  }
//}}}
//{{{
static uint8_t* manufacturerStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  #define USBD_MANUFACTURER_STRING  "colin"
  USBD_GetString ((uint8_t *)USBD_MANUFACTURER_STRING, strDesc, length);
  return strDesc;
  }
//}}}
//{{{
static uint8_t* productStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {

  #define USBD_PRODUCT_HS_STRING    "HS stm32 audio"
  #define USBD_PRODUCT_FS_STRING    "FS stm32 audio"

  if (speed == USBD_SPEED_HIGH)
    USBD_GetString ((uint8_t *)USBD_PRODUCT_HS_STRING, strDesc, length);
  else
    USBD_GetString ((uint8_t *)USBD_PRODUCT_FS_STRING, strDesc, length);
  return strDesc;
  }
//}}}
//{{{
static uint8_t* serialStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {

  *length = USB_SIZ_STRING_SERIAL;
  getSerialNum();
  return (uint8_t*)kStringSerial;
  }
//}}}
//{{{
static uint8_t* configStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  #define USBD_CONFIGURATION_STRING "AUDIO Config"
  USBD_GetString ((uint8_t*)USBD_CONFIGURATION_STRING, strDesc, length);
  return strDesc;
  }
//}}}
//{{{
static uint8_t* interfaceStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {

  #define USBD_INTERFACE_STRING     "AUDIO Interface"
  USBD_GetString ((uint8_t*)USBD_INTERFACE_STRING, strDesc, length);
  return strDesc;
  }
//}}}

static USBD_DescriptorsTypeDef audioDescriptor = {
  deviceDescriptor,
  langIDStrDescriptor,
  manufacturerStrDescriptor,
  productStrDescriptor,
  serialStrDescriptor,
  configStrDescriptor,
  interfaceStrDescriptor,
  };
//}}}
//{{{  tAudioData
typedef struct {
  uint8_t       mBuffer[AUDIO_OUT_PACKET_BUF_SIZE];
  uint8_t       mPlayStarted;
  uint16_t      mWritePtr;
  __IO uint32_t mAltSetting;

  uint8_t       mCommand;
  uint8_t       mData[USB_MAX_EP0_SIZE];
  uint8_t       mLength;
  uint8_t       mUnit;
  } tAudioData;
//}}}
//{{{  audioClass
//{{{
static uint8_t usbInit (USBD_HandleTypeDef* device, uint8_t cfgidx) {

  // Open EP OUT
  USBD_LL_OpenEP (device, AUDIO_OUT_EP, USBD_EP_TYPE_ISOC, AUDIO_IN_PACKET_SIZE);

  // allocate audioData
  tAudioData* audioData = malloc (sizeof (tAudioData));
  audioData->mPlayStarted = 0;
  audioData->mWritePtr = 0;
  audioData->mAltSetting = 0;
  device->pClassData = audioData;

  BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_BOTH, AUDIO_DEFAULT_VOLUME, AUDIO_FREQ);
  BSP_AUDIO_OUT_SetAudioFrameSlot (SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1 | SAI_SLOTACTIVE_2 | SAI_SLOTACTIVE_3);

  // Prepare Out endpoint to receive 1st packet
  USBD_LL_PrepareReceive (device, AUDIO_OUT_EP, audioData->mBuffer, AUDIO_IN_PACKET_SIZE);

  return USBD_OK;
  }
//}}}
//{{{
static uint8_t usbDeInit (USBD_HandleTypeDef* device, uint8_t cfgidx) {

  // close out ep
  USBD_LL_CloseEP (device, AUDIO_OUT_EP);

  // stop audio
  BSP_AUDIO_OUT_Stop (CODEC_PDWN_SW);
  free (device->pClassData);
  device->pClassData = NULL;

  return USBD_OK;
  }
//}}}

//{{{
static uint8_t usbSetup (USBD_HandleTypeDef* device, USBD_SetupReqTypedef* req) {

  tAudioData* audioData = (tAudioData*)device->pClassData;

  char str[100];
  sprintf (str, "setup %d", req->bmRequest & USB_REQ_TYPE_MASK);
  BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
  BSP_LCD_DisplayStringAtLine (debugOffset + (debugLine++ % debugSize), (uint8_t*)str);

  switch (req->bmRequest & USB_REQ_TYPE_MASK) {
    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest) {
        case USB_REQ_GET_DESCRIPTOR:
          if ((req->wValue >> 8) == AUDIO_DESCRIPTOR_TYPE)
            USBD_CtlSendData (device, kConfigDescriptor + 18, MIN(USB_AUDIO_DESC_SIZ, req->wLength));
          break;

        case USB_REQ_GET_INTERFACE :
          USBD_CtlSendData (device, (uint8_t*)&audioData->mAltSetting, 1);
          break;

        case USB_REQ_SET_INTERFACE :
          if ((uint8_t)(req->wValue) <= USBD_MAX_NUM_INTERFACES)
            audioData->mAltSetting = (uint8_t)req->wValue;
          else // NAK
            USBD_CtlError (device, req);
          break;

        default:
          USBD_CtlError (device, req);
          return USBD_FAIL;
        }
      break;

    case USB_REQ_TYPE_CLASS :
      switch (req->bRequest) {
        case AUDIO_REQ_GET_CUR:
          memset (audioData->mData, 0, 64);
          USBD_CtlSendData (device, audioData->mData, req->wLength);
          break;

        case AUDIO_REQ_SET_CUR:
          if (req->wLength) {
            // prepare to rx buffer from ep0
            USBD_CtlPrepareRx (device, audioData->mData, req->wLength);
            audioData->mCommand = AUDIO_REQ_SET_CUR; // set request value
            audioData->mLength = req->wLength;       // set request data length
            audioData->mUnit = HIBYTE(req->wIndex);  // set request target unit
            }
          break;

        default:
          USBD_CtlError (device, req);
          return USBD_FAIL;
        }
    }
  return USBD_OK;
  }
//}}}

//{{{
static uint8_t usbEp0TxReady (USBD_HandleTypeDef* device) {
  return USBD_OK;
  }
//}}}
//{{{
static uint8_t usbEp0RxReady (USBD_HandleTypeDef* device) {
// only SET_CUR request is managed

  tAudioData* audioData = (tAudioData*)device->pClassData;

  char str[100];
  sprintf (str, "usbEp0RxReady %d %d %d", audioData->mCommand, audioData->mUnit, audioData->mLength);
  BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
  BSP_LCD_DisplayStringAtLine (3, (uint8_t*)str);

  if (audioData->mCommand == AUDIO_REQ_SET_CUR) {
    if (audioData->mUnit == AUDIO_OUT_STREAMING_CTRL) {
      BSP_AUDIO_OUT_SetMute (audioData->mData[0]);
      audioData->mCommand = 0;
      audioData->mLength = 0;
      }
    }

  return USBD_OK;
  }
//}}}

//{{{
static uint8_t usbDataIn (USBD_HandleTypeDef* device, uint8_t epNum) {
  return USBD_OK;
  }
//}}}
//{{{
static uint8_t usbDataOut (USBD_HandleTypeDef* device, uint8_t epNum) {

