ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/AUDIO_Standalone/Src/main.c
  if (epNum == AUDIO_OUT_EP) {
    tAudioData* audioData = (tAudioData*)device->pClassData;
    if (!audioData->mPlayStarted)
      if (audioData->mWritePtr >= AUDIO_OUT_PACKET_BUF_SIZE / 2) {
        BSP_AUDIO_OUT_Play ((uint16_t*)audioData->mBuffer, AUDIO_OUT_PACKET_BUF_SIZE);
        audioData->mPlayStarted = 1;
        }

    // twiddle samples into slots
    uint8_t* fromPtr = audioData->mBuffer + audioData->mWritePtr + 4*(AUDIO_PACKET_SAMPLES-1);
    uint8_t* toPtr = audioData->mBuffer + audioData->mWritePtr + 8*(AUDIO_PACKET_SAMPLES-1);
    for (int i = 0; i < AUDIO_PACKET_SAMPLES; i++) {
      toPtr[0] = fromPtr[0];
      toPtr[1] = fromPtr[1];
      toPtr[2] = fromPtr[2];
      toPtr[3] = fromPtr[3];
      toPtr[4] = fromPtr[0];
      toPtr[5] = fromPtr[1];
      toPtr[6] = fromPtr[2];
      toPtr[7] = fromPtr[3];
      fromPtr -= 4;
      toPtr -= 8;
      }

    // prepare outEndpoint to rx next audio packet
    audioData->mWritePtr += AUDIO_OUT_PACKET_SIZE;
    if (audioData->mWritePtr >= AUDIO_OUT_PACKET_BUF_SIZE)
      audioData->mWritePtr = 0;

    USBD_LL_PrepareReceive (device, AUDIO_OUT_EP, &audioData->mBuffer[audioData->mWritePtr], AUDIO_IN_PACKET_SIZE);
    }

  return USBD_OK;
  }
//}}}

//{{{
static uint8_t usbSof (USBD_HandleTypeDef* device) {
  return USBD_OK;
  }
//}}}

//{{{
static uint8_t usbIsoInInComplete (USBD_HandleTypeDef* device, uint8_t epNum) {
  return USBD_OK;
  }
//}}}
//{{{
static uint8_t usbIsoOutInComplete (USBD_HandleTypeDef* device, uint8_t epNum) {
  return USBD_OK;
  }
//}}}

//{{{
static uint8_t* usbGetConfigDescriptor (uint16_t* length) {
  *length = sizeof (kConfigDescriptor);
  return kConfigDescriptor;
  }
//}}}
//{{{
static uint8_t* usbGetDeviceQualifierDescriptor (uint16_t *length) {
  *length = sizeof (kDeviceQualifierDescriptor);
  return kDeviceQualifierDescriptor;
  }
//}}}

static USBD_ClassTypeDef audioClass = {
  usbInit,
  usbDeInit,
  usbSetup,
  usbEp0TxReady,
  usbEp0RxReady,
  usbDataIn,
  usbDataOut,
  usbSof,
  usbIsoInInComplete,
  usbIsoOutInComplete,
  usbGetConfigDescriptor,
  usbGetConfigDescriptor,
  usbGetConfigDescriptor,
  usbGetDeviceQualifierDescriptor,
  };
//}}}

// BSP_audio out
//{{{
static void audioClock (int faster) {
// Set the PLL configuration according to the audio frequency
// target = 48000*2*2 * 256 = 49.152Mhz

// slower
// - PLLI2S_VCO: VCO_344 N
// - I2S_CLK = PLLI2S_VCO / PLLI2SQ = 344/7 = 49.142 Mhz
// - I2S_CLK1 = I2S_CLK / PLLI2SDIVQ = 49.142/1 = 49.142 Mhz

// faster
// - PLLI2S_VCO: VCO_295 N
// - I2S_CLK = PLLI2S_VCO / PLLI2SQ = 295/6 = 49.166 Mhz
// - I2S_CLK1 = I2S_CLK / PLLI2SDIVQ = 49.1666/1 = 49.142 Mhz

  if (faster != oldFaster) {
    RCC_PeriphCLKInitTypeDef RCC_ExCLKInitStruct;
    HAL_RCCEx_GetPeriphCLKConfig (&RCC_ExCLKInitStruct);
    RCC_ExCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
    RCC_ExCLKInitStruct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
    RCC_ExCLKInitStruct.PLLI2S.PLLI2SP = 8;
    RCC_ExCLKInitStruct.PLLI2S.PLLI2SN = faster ? 295 : 344;
    RCC_ExCLKInitStruct.PLLI2S.PLLI2SQ = faster ? 6 : 7;
    RCC_ExCLKInitStruct.PLLI2SDivQ = 1;
    HAL_RCCEx_PeriphCLKConfig (&RCC_ExCLKInitStruct);
    oldFaster = faster;
    }
  }
//}}}
//{{{
void BSP_AUDIO_OUT_ClockConfig (SAI_HandleTypeDef* hsai, uint32_t freq, void* Params) {
  audioClock (0);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {

  writePtrOnRead = ((tAudioData*)gUsbDevice.pClassData)->mWritePtr / AUDIO_OUT_PACKET_SIZE;
  if (writePtrOnRead > AUDIO_PACKETS/2) // faster
    audioClock (1);
  else if (writePtrOnRead < AUDIO_PACKETS/2) // slower
    audioClock (0);
  }
//}}}
//}}}

//{{{
static void dec (int line, int n) {
  char buf[80];
  sprintf (buf, "%5d", n);
  BSP_LCD_SetTextColor (LCD_COLOR_YELLOW);
  BSP_LCD_DisplayStringAtLine (line, (uint8_t*)buf);
  }
//}}}
//{{{
static void touch() {

  TS_StateTypeDef TS_State;
  BSP_TS_GetState (&TS_State);
  if (TS_State.touchDetected == 1) {
    if (TS_State.touchWeight[0] > 128)
      BSP_LCD_SetTextColor (LCD_COLOR_GREEN);
    else
      BSP_LCD_SetTextColor (LCD_COLOR_YELLOW);

    BSP_TS_GetState (&TS_State);
    BSP_LCD_FillCircle (TS_State.touchX[0], TS_State.touchY[0], 20);
    }
  }
//}}}
//{{{
static void initGraphics() {

  BSP_LCD_Init();
  BSP_LCD_LayerDefaultInit (1, LCD_FB_START_ADDRESS);
  BSP_LCD_SelectLayer(1);

  BSP_LCD_SetBackColor (LCD_COLOR_BLACK);
  BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
  BSP_LCD_Clear(LCD_COLOR_BLACK);
  BSP_LCD_SetFont (&Font16);
  BSP_LCD_DisplayOn();

  BSP_LCD_DisplayStringAtLine (0, (uint8_t*)kVersion);

  // some shapes
  #define TOUCH_RECORD_XMIN   300
  #define TOUCH_RECORD_XMAX   340
  #define TOUCH_RECORD_YMIN   212
  #define TOUCH_RECORD_YMAX   252
  #define TOUCH_PLAYBACK_XMIN 125
  #define TOUCH_PLAYBACK_XMAX 165
  #define TOUCH_PLAYBACK_YMIN 212
  #define TOUCH_PLAYBACK_YMAX 252

  Point PlaybackLogoPoints[] = {{TOUCH_PLAYBACK_XMIN, TOUCH_PLAYBACK_YMIN},
                                {TOUCH_PLAYBACK_XMAX, (TOUCH_PLAYBACK_YMIN+TOUCH_PLAYBACK_YMAX)/2},
                                {TOUCH_PLAYBACK_XMIN, TOUCH_PLAYBACK_YMAX}};

  BSP_LCD_SetTextColor (LCD_COLOR_CYAN);
  BSP_LCD_FillPolygon (PlaybackLogoPoints, 3);                 /* Playback sign */
  BSP_LCD_FillCircle ((TOUCH_RECORD_XMAX+TOUCH_RECORD_XMIN)/2, /* Record circle */
                      (TOUCH_RECORD_YMAX+TOUCH_RECORD_YMIN)/2,
                      (TOUCH_RECORD_XMAX-TOUCH_RECORD_XMIN)/2);
  }
//}}}

int main() {
  SCB_EnableICache();
  SCB_EnableDCache();
  HAL_Init();
  //{{{  configure system clock
  // System Clock source            = PLL (HSE)
  // SYSCLK(Hz)                     = 216000000
  // HCLK(Hz)                       = 216000000
  // AHB Prescaler                  = 1
  // APB1 Prescaler                 = 4
  // APB2 Prescaler                 = 2
  // HSE Frequency(Hz)              = 25000000
  // PLL_M                          = 25
  // PLL_N                          = 432
  // PLL_P                          = 2
  // PLLSAI_N                       = 384
  // PLLSAI_P                       = 8
  // VDD(V)                         = 3.3
  // Main regulator output voltage  = Scale1 mode
  // Flash Latency(WS)              = 7

  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  // Enable HSE Oscillator and activate PLL with HSE as source
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig (&RCC_OscInitStruct) != HAL_OK)
    while(1) {}

  // Activate the OverDrive to reach the 216 Mhz Frequency
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
    while(1) {}

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                                 RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig (&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
    while(1) {}
  //}}}

  BSP_LED_Init (LED1);
  initGraphics();
  BSP_TS_Init (BSP_LCD_GetXSize(), BSP_LCD_GetYSize());

  // init usbDevice library
  gUsbDevice.pClassData = NULL;
  USBD_Init (&gUsbDevice, &audioDescriptor, 0);
  USBD_RegisterClass (&gUsbDevice, &audioClass);
  USBD_Start (&gUsbDevice);

  while (1) {
    touch();
    dec (1, writePtrOnRead);
    BSP_LCD_SetTextColor (oldFaster ? LCD_COLOR_YELLOW : LCD_COLOR_MAGENTA);
    BSP_LCD_DisplayStringAtLine (2, (uint8_t*)(oldFaster ? "faster" : "slower"));
    HAL_Delay (40);
    }
  }
